# FamilyOverconstraintCB Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyOverconstraintCB Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Dimension overconstrains the Family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyOverconstraintCB { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyOverconstraintCB As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyOverconstraintCB {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace